Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memr.tmx
Source language: ca
Languages: es

source: La frase ``m'agrada nadar'' té una estructura sintàctica molt diferent en anglés () i en alemany ().
es: La frase ``me gusta nadar'' tiene una estructura sintáctica muy diferente en inglés () y en alemán ().

source: La identificació de patrons de categories morfològiques que es corresponguen amb els sintagmes més freqüents pot servir, a més de per a fer reordenaments, per a resoldre la concordança de nombre i gènere.
es: La identificación de patrones de categorías morfológicas que se correspondan con los sintagmas más frecuentes puede servir, además de para hacer reordenamientos, para resolver la concordancia de número y género.

source: La multinacional WorldTrans ha decidit ampliar el seu sistema de traducció automàtica multilingüe LetTrans (que tradueix correspondència comercial entre qualssevol dues llengües d'un grup de quinze) i afegir-hi la capacitat de traduir del swahili a les quinze llengües i de les quinze llengües cap al swahili.
es: La multinacional WorldTrans ha decidido ampliar su sistema de traducción automática multilingüe LetTrans (que traduce correspondencia comercial entre cualquier dos lenguas de un grupo de quince) y añadir la capacidad de traducir del swahili a las quince lenguas y de las quince lenguas hacia al swahili.

source: La primera (d'entrada) indica la lletra que es llig; la segona (d'eixida) indica el que s'ha de produir (zero, un o més símbols).
es: La primera (de entrada) indica la letra que se lee; la segunda (de salida) indica lo que se tiene que producir (cero, uno o más símbolos).

source: La representació anàloga per al segon exemple podria ser:
es: La representación análoga para el segundo ejemplo podría ser:

source: La secció dóna més detalls sobre l'anàlisi i la generació morfològiques.
es: La sección da más detalles sobre el análisis y la generación morfológica.

source: La semàntica de les frases del primer exemple es podria representar així:
es: La semántica de las frases del primer ejemplo se podría representar así:

source: La sintaxi generativa actual (vegeu {chomsky96b
es: La sintaxis generativa actual (mirad {chomsky96b

source: La traducció automàtica real, és a dir, la que s'usa en la realitat, es pot veure, d'una banda, com el resultat d'una sèrie d'aproximacions (moltes d'elles inevitables) sobre un model ideal i teòricament motivat basat en el principi de composicionalitat semàntica (vegeu el capítol ) i, d'altra banda, com el resultat d'una sèrie de refinaments inevitables sobre un sistema mot per mot que substitueix rudimentàriament els mots de les oracions per equivalents constants sense fer cap altra operació.
es: La traducción automática real, es decir, la que se usa en la realidad, se puede ver, por un lado, como el resultado de una serie de aproximaciones (muchas de ellas inevitables) sobre un modelo ideal y teóricamente motivado basado en el principio de composicionalidad semántica (véase el capítulo ) y, por otro lado, como el resultado de una serie de refinamientos inevitables sobre un sistema palabra por palabra que sustituye rudimentariamente las palabras de las oraciones por equivalentes constantes sin hacer ninguna otra operación.

source: La traducció automàtica per transferència és sempre... ... morfològica.
es: La traducción automática por transferencia es siempre... ... morfológica.

source: La traducció d'una oració es pot veure com una interpretació d'aquesta (és a dir, com l'expressió en la llengua meta del seu significat).
es: La traducción de una oración se puede ver como una interpretación de ésta (es decir, como la expresión en la lengua meta de su significado).

source: La { generació} morfològica fa l'operació inversa.
es: La { generación} morfológica hace la operación inversa.

source: Les entitats $RA_1$ a $RA_4$ són les representacions abstractes (tant RALO com RALM) que usen els mòduls de transferència.} En canvi, en un sistema d'interlingua no hi ha mòduls de transferència; un sistema trilingüe basat en una interlingua tindria només sis mòduls: tres d'anàlisi ($A'_1$, $A'_2$ i $A'_3$) i tres de generació ($G'_1$, $G'_2$ i $G'_3$).
es: Las entidades $RA_1$ a $RA_4$ son las representaciones abstractas (tanto RALO como RALM) que usan los módulos de transferencia.} En cambio, en un sistema de interlingua no hay módulos de transferencia; un sistema trilingüe basado en una interlingua tendría sólo seis módulos: tres de análisis ($A'_1$, $A'_2$ y $A'_3$) y tres de generación ($G'_1$, $G'_2$ y $G'_3$).

source: Les estratègies de traducció automàtica es poden dividir en dos grans grups, les directes i les indirectes.
es: Las estrategias de traducción automática se pueden dividir en dos grandes grupos, las directas y las indirectas.

source: Les estructures sintàctiques usades per diverses llengües a l'hora d'expressar el fet que alguna acció agrada a algú són molt diverses.
es: Las estructuras sintácticas usadas por varias lenguas a la hora de expresar el hecho que alguna acción gusta a alguien son muy diversas.

source: Les figures , i il·lustren el funcionament de les fases d'anàlisi, transferència i generació, respectivament, d'un sistema de transferència morfològica avançada (és a dir, amb reconeixement de patrons senzills que representen sintagmes) de l'anglés al català.
es: Las figuras , y ilustran el funcionamiento de las fases de análisis, transferencia y generación, respectivamente, de un sistema de transferencia morfológica avanzada (es decir, con reconocimiento de patrones sencillos que representan sintagmas) del inglés al catalán.

source: Les fletxes que ixen d'un vèrtex qualsevol del graf tenen dues etiquetes separades per ``{ :}''.
es: Las flechas que salen de un vértice cualquiera del grafo tienen dos etiquetas separadas por ``{ :}''.

source: Les interlingües poden ser de molts tipus.
es: Las interlinguas pueden ser de muchos tipos.

source: Les regles s'apliquen de la manera usual: d'esquerra a dreta, reordenant la seqüència més llarga possible, i sense que se solapen les àrees reordenades.
es: Las reglas se aplican de la manera usual: de izquierda a derecha, reordenando la secuencia más larga posible, y sin que se solapen las áreas reordenadas.

source: Les regles són, en el fons, els subarbres bàsics amb els quals es construeixen els arbres d'anàlisi sintàctica de totes les frases sintàcticament acceptables; és a dir, aquestes regles especifiquen com es pot construir un sintagma o { constituent
es: Las reglas son, en el fondo, los subárboles básicos con los cuales se construyen los árboles de análisis sintáctico de todas las frases sintácticamente aceptables; es decir, estas reglas especifican cómo se puede construir un sintagma o { constituyente

source: Les representacions abstractes apropen les dues llengües eliminant-ne alguns detalls específics i destacant característiques generals que poden així ser tractades més fàcilment pel mòdul de transferència.
es: Las representaciones abstractas aproximan las dos lenguas eliminando algunos detalles específicos y destacando características generales que pueden así ser tratadas más fácilmente por el módulo de transferencia.

source: Les situacions no previstes indiquen que l'oració d'entrada no és acceptada per la gramàtica i donen lloc a una situació d'error.}
es: Las situaciones no previstas indican que la oración de entrada no está aceptada por la gramática y dan lugar a una situación de error.}

source: Les traduccions inacceptables estan marcades amb un asterisc.
es: Las traducciones inaceptables están marcadas con un asterisco.

source: Les traduccions observades es poden explicar amb les tres regles següents: $R_1$: { cuyo} { n} $$ { art} { n} { de} { art} { qual} $R_2$: { cuyo} { n}$_1$ { de} { n}$_2$ $$ { art} { n}$_1$ { de} { n}$_2$ { de} { art} { qual} $R_3$: { cuyo} { n} { adj} $$ { art} { n} { adj} { de} { art} { qual} Les regles que s'apliquen en cada cas són: $R_1$ $R_2$ $R_3$ $R_2$; no abarca el segment de francés i trenca el sintagma; $R_3$; no abarca el segment de clase i trenca el sintagma; $R_3$; no abarca el segment de clase de francés i trenca el sintagma.
es: Las traducciones observadas se pueden explicar con las tres reglas siguientes: $R_1$: { cuyo} { n} $$ { arte} { n} { de arte} { } { que} $R_2$: { cuyo} { n}$_1$ { de } { }n $_2$ $$ { arte} { n}$_1$ { de } { }n $_2$ { de arte} { } { que} $R_3$: { cuyo} { n} { adj} $$ { arte} { n} { adj} { de arte} { } { cual} Las reglas que se aplican en cada caso son: $R_1$ $R_2$ $R_3$ $R_2$; no abarca el segmento de francés y rompe el sintagma; $R_3$; no abarca el segmento de clase y rompe el sintagma; $R_3$; no abarca el segmento de clase de francés y rompe el sintagma.

source: Les transicions de l'últim tipus no són necessàries ni convenients en el transductor final, però poden ser molt útils durant la construcció.
es: Las transiciones del último tipo no son necesarias ni convenientes en el transductor final, pero pueden ser muy útiles durante la construcción.

source: Les transicions etiquetades $(:)$ és poden eliminar durant la determinització usant una tècnica paral·lela a l'anomenada { clausura $$}.
es: Las transiciones etiquetadas $(:)$ se pueden eliminar durante la determinización usando una técnica paralela a la nombrada { clausura $$}.

source: LetTrans és un sistema d'interlingua: per a afegir el swahili només es necessiten experts en swahili i en la interlingua de LetTrans.
es: LetTrans es un sistema de interlingua: para añadir el swahili sólo se necesitan expertos en swahili y en la interlingua de LetTrans.

source: Molts dels sistemes indirectes són sistemes de transferència.
es: Muchos de los sistemas indirectos son sistemas de transferencia.

source: Ng{a} whare nui o te aroha (Les cases grans de l'amor) Te hau o te aroha (El vent de l'amor) Ng{a} pukapuka o te whare (El llibre de la casa) Ng{a} ingoa o te pukapuka nui (Els noms del llibre gran) Te ingoa o ng{a} whare (El nom de les cases)
es: Ng{a} whare nui o te aroha (Las casas grandes del amor) Te hau o te aroha (El viento del amor) Ng{a} pukapuka o te whare (El libro de la casa) Ng{a} ingoa o te pukapuka nui (Los nombres del libro grande) Te ingoa o ng{a} whare (El nombre de las casas)

source: No es busca la perfecció sinó més aviat traduccions en brut ràpides i fàcils d'entendre o de corregir (és a dir, amb pocs errors).
es: No se busca la perfección sino más bien traducciones en bruto rápidas y fáciles de entender o de corregir (es decir, con pocos errores).

source: No ha estat capaç de detectar el patró verb art nom adj prep nompropi i aplica la regla $R_2$ que és la més llarga que concorda.
es: No ha sido capaz de detectar el patrón verbo arte nombre adj prep nompropi y aplica la regla $R_2$ que es la más larga que concuerda.

source: No oblidem que aquesta descripció assumeix que l'ambigüitat lèxica (múltiples interpretacions dels mots) i estructural (més d'un arbre d'anàlisi sintàctica) ha estat idealment resolta.
es: No olvidemos que esta descripción asume que la ambigüedad léxica (múltiples interpretaciones de las palabras) y estructural (más de un árbol de análisis sintáctico) ha sido idealmente resuelta.

source: No reconeix la seqüència { art}--{ adj}--{ subst}, i tradueix mot per mot.
es: No reconoce la secuencia { arte}--{ adj}--{ subst}, y traduce palabra por palabra.

source: No us preocupeu de la contracció preposició--article.
es: No os preocupéis de la contracción preposición--artículo.

source: Només una d'aquestes operacions és esperable en una situació normal de traducció automàtica: La postedició en un sistema de traducció automàtica usat per a l'assimilació.
es: Sólo una de estas operaciones es esperable en una situación normal de traducción automática: La postedición en un sistema de traducción automática usado para la asimilación.

source: Notem que per a aquesta última fase són necessaris diversos experts bilingües en sistemes de transferència. La figura il·lustra el cost d'afegir $L_4$ al sistema de transferència;
es: Notamos que para esta última fase son necesarios varios expertos bilingües en sistemas de transferencia. La figura ilustra el coste de añadir $L_4$ al sistema de transferencia;

source: Noteu que un transductor de lletres que siga determinista respecte a l'alfabet de les transicions $L=()()$ pot perfectament ser indeterminista respecte de l'alfabet d'entrada $$.
es: Notad que un transductor de letras que sea determinista respecto al alfabeto de las transiciones $L=()()$ puede perfectamente ser indeterminista respecto del alfabeto de entrada $$.

source: On no s'especifica l'agent de l'acció de donar nom; la casella d'agent podria ser útil per a representar frases de l'estil de `Jo l'anomene Joan'.
es: Donde no se especifica el agente de la acción de dar nombre; la casilla de agente podría ser útil para representar frases del estilo de `Yo lo denomino Joan'.

source: Per a afegir-hi una nova llengua hem escrit 6 mòduls.
es: Para añadir una nueva lengua hemos escrito 6 módulos.

source: Per a minimitzar el transductor resultant, es pot usar un algorisme com el descrit per {vandesnepscheut93b}, que consta de dos passos idèntics que es poden resumir com segueix: en cada pas, les fletxes de les transicions del transductor de lletres s'inverteixen, de manera que l'estat inicial és el final i al revés, i el transductor resultant es determinitza respecte de $L$ (és a dir, es formen nous estats amb conjunts d'estats vells de manera que la nova $$ és $:Q L Q$).
es: Para minimizar el transductor resultante, se puede usar un algoritmo como el descrito por {vandesnepscheut93b}, que consta de dos pasos idénticos que se pueden resumir como sigue: en cada paso, las flechas de las transiciones del transductor de letras se invierten, de manera que el estado inicial es el final y al revés, y el transductor resultante se determiniza respecto de $L$ (es decir, se forman nuevos estados con conjuntos de estados viejos de manera que la nueva $$ es $:Q L Q$).

source: Per a produir traduccions acceptables, ràpides i intel·ligibles, s'ha d'afegir un processament lèxic robust (per exemple, per a tractar expressions multimot o per a elegir equivalents adequats per a mots lèxicament ambigus) i un processament estructural local o global que es basa en regles simples i ben formulades per a algunes transformacions estructurals (reordenaments, concordança, etc.).
es: Para producir traducciones aceptables, rápidas e inteligibles, se tiene que añadir un procesamiento léxico robusto (por ejemplo, para tratar expresiones multipalabra o para elegir equivalentes adecuados para palabras léxicamente ambiguas) y un procesamiento estructural local o global que se basa en reglas simples y muy formuladas para algunas transformaciones estructurales (reordenamientos, concordancia, etc.).

source: Per a quina aplicació de la informàtica a la traducció podrien servir els resultats d'un estudi numèric com aquest?
es: ¿Para qué aplicación de la informática a la traducción podrían servir los resultados de un estudio numérico como este?

source: Per a saber quan ha de desplaçar una categoria lèxica a la pila o quan i com ha de reduir el cim de la pila, té en compte una o més categories lèxiques de les que està a punt de llegir i un o més elements del cim de la pila, i fa l'acció que li indica una taula d'anàlisi sintàctica que es construeix a partir de la gramàtica que s'haja proposat per a la llengua origen i que l'analitzador consulta en cada pas de l'anàlisi.
es: Para saber cuando tiene que desplazar una categoría léxica a la pila o cuando y cómo tiene que reducir la cumbre de la pila, tiene en cuenta una o más categorías léxicas de las que está a punto de leer y uno o más elementos de la cumbre de la pila, y hace la acción que le indica una mesa de análisis sintáctico que se construye a partir de la gramática que se haya propuesto para la lengua origen y que el analizador consulta en cada paso del análisis.

source: Per això, els transductors de lletres es poden determinitzar i minimitzar (respecte de l'alfabet $L$) usant els algorismes existents per a AFND i AFD.
es: Por eso, los transductores de letras se pueden determinizar y minimizar (respecto del alfabeto $L$) usando los algoritmos existentes para AFND y AFD.

source: Per altra banda, la part final del processament d'angoixaven i de cantaven seria molt similar, ja que els dos verbs es conjuguen segons el mateix paradigma.
es: Por otro lado, la parte final del proceso deangoixaven y de cantaven sería muy similar, ya que los dos verbos se conjugan según el mismo paradigma.

source: Per exemple, $L_1$=espanyol i $L_2$=català: un buen postre $$ *un bon postres (unes bones postres); una señal inequívoca $$ *una senyal inequívoca (un senyal inequívoc).
es: Por ejemplo, $L_1$=español y $L_2$=catalán: un buen postre $$ *un buen postres (unes bones postres); una señal inequívoca $$ una señal inequívoca (una señal inequívoca).

source: Per exemple, si hem construït un sistema de transferència que tradueix de l'anglés al català, podem usar el mòdul d'anàlisi de l'anglés per a construir un sistema de l'anglés a l'espanyol.
es: Por ejemplo, si hemos construido un sistema de transferencia que traduce del inglés al catalán, podemos usar el módulo de análisis del inglés para construir un sistema del inglés al español.

source: Per exemple, SDL Transcend està disponible en {http://www.freetranslation.com
es: Por ejemplo, SDL Transcend está disponible en {http://www.freetranslation.com

source: Per exemple, amb les regles [$R_1:$] $a n n a$, [$R_2:$] $a_1 a_2 n n a_2 a_1$ [$R_3:$] $n_1 n_2 n_2 ``de'' n_1$ es tradueixen bé totes excepte la (a) i la (f), que quedarien: ``*Una $[$tardor fosca$]_{R_1}$ nit'' i ``*Una $[$tardor fosca$]_{R_1}$ $[$marea alta$]_{R_1}$'' perquè les regles són incapaces de reconéixer els sintagmes complets.
es: Por ejemplo, con las reglas [$R_1:$] $a n n a$, [$R_2:$] $a_1 a_2 n n a_2 a_1$ [$R_3:$] $n_1 n_2 n_2 ``de'' n_1$ se traducen bien todas excepto la (a) y la (f), que quedarían: ``Una $[$otoño oscuro$]_{R_1}$ noche'' y ``Una $[$otoño oscuro$]_{R_1}$ $[$marea alta$]_{R_1}$'' porque las reglas son incapaces de reconocer los sintagmas completos.

source: Per exemple, detectar la seqüència { art}--{ subst} pot servir per propagar el gènere i el nombre del substantiu a l'article.
es: Por ejemplo, detectar la secuencia { arte}--{ subst} puede servir para propagar el género y el número del sustantivo al artículo.

source: Per exemple, el mot ``fondos'' apareix davant del mot ``estructurales'' 63 vegades de les 203 vegades que apareix ``estructurales'', és a dir, unes 3 de cada 10 vegades, quan a l'atzar apareixeria 410 vegades per cada 925.461, és a dir, unes 4 vegades cada 10.000.
es: Por ejemplo, la palabra ``fondos'' aparece ante la palabra ``estructurales'' 63 veces de las 203 veces que aparece ``estructurales'', es decir, unas 3 de cada 10 veces, cuando al azar aparecería 410 veces por cada 925.461, es decir, unas 4 veces cada 10.000.

source: Per exemple, els adjectius catalans van normalment darrere dels substantius mentre que els anglesos van normalment davant; traduir comporta, per tant, canviar els adjectius de posició.
es: Por ejemplo, los adjetivos catalanes van normalmente detrás de los sustantivos mientras que los ingleses van normalmente delante; traducir conlleva, por lo tanto, cambiar los adjetivos de posición.

source: Per exemple, en català, l'agent de l'acció de donar plaer es representa com a subjecte, però en anglés com a objecte.
es: Por ejemplo, en catalán, el agente de la acción de dar placer se representa como sujeto, pero en inglés como objeto.

source: Per exemple, en la frase catalana ``m'agraden els llimons'', qui produeix el plaer (``els llimons'') fa de subjecte en l'oració, mentre que en l'equivalent anglesa (``I like lemons'') hi fa d'objecte directe. És cert que aquest cas es podria tractar de manera particular en un sistema de transferència sintàctica, fent la transformació corresponent en l'arbre d'anàlisi sintàctica quan el verb fos ``agradar'' (és a dir, fent una transferència estructural dependent del lèxic: vegeu l'exercici ), però hi ha casos en què també convé oblidar l'estructura sintàctica concreta de la frase en LO i fixar-se més aviat en la semàntica, com per exemple quan cal resoldre ambigüitats causades per l'anàfora o l'el·lipsi (vegeu les pàgines i ).
es: Por ejemplo, en la frase catalana "m'agraden els llimons", quien produce el placer ("els llimons'') hace de sujeto en la oración, mientras que en la equivalente inglesa ("I like lemons'') hace de objeto directo. Es cierto que este caso se podría tratar de manera particular en un sistema de transferencia sintáctica, haciendo la transformación correspondiente en el árbol de análisis sintáctico cuando el verbo fuera "gustar'' (es decir, haciendo una transferencia estructural dependiente del léxico: ved el ejercicio ), pero hay casos en que también conviene olvidar la estructura sintáctica concreta de la frase en LO y fijarse más bien en la semántica, como por ejemplo cuando hay que resolver ambigüedades causadas por la anáfora o la elipsis (véase las páginas y ).

source: Per exemple, fixeu-vos en l'imperatiu espanyol demos: si va seguit del pronom enclític le, forma amb aquest un únic mot i rep un nou accent ortogràfic: démosle; si el pronom és nos, a més es perd una consonant: démonos; amb dos pronoms, pot ser { démonoslos}, etc.
es: Por ejemplo, fijaos en el imperativo español demos: si va seguido del pronombre enclítico le, forma con este una única palabra y recibe un nuevo acento ortográfico: démosle; si el pronombre es nos, además se pierde una consonante: démonos; con dos pronombres, puede ser { démonoslos}, etc.

source: Per exemple, l'anàlisi morfològica de la forma superficial vius (ambigua) donaria com a resultat dues formes lèxiques: { viure<verb><pres. ind.><2a pers.><sing.>} i { viu<adj.><masc.><pl.>}, on els lemes són, respectivament, viure i viu.
es: Por ejemplo, el análisis morfológico de la forma superficial vius (ambigua) daría como resultado dos formas léxicas: { viure<verbo><pres. ind.><2a pers.><sing.>} y { viu<adj.><masc.><pl.>}, donde los lemas son, respectivamente, viure y viu.

source: Per exemple, les dues frases angleses esmentades més amunt ``Sam gave a book to Leslie'' i ``Sam gave Leslie a book'' tenen una sintaxi diferent però volen dir exactament el mateix: ``Sam va donar un llibre a Leslie''; el que més compta és qui fa l'acció, quin objecte afecta i qui n'és el destinatari, però no l'ordre en què aquestes entitats apareixen en la frase en LO {arnold93j}.
es: Por ejemplo, las dos frases inglesas mencionadas más arriba "Sam gave a book to Leslie'' y "Sam gave Leslie a book'' tienen una sintaxis diferente pero quieren decir exactamente lo mismo: "Sam le dio un libro a Leslie''; el que más cuenta es quien hace la acción, a qué objeto afecta y quién es el destinatario, pero no el orden en que estas entidades aparecen en la frase en LO {arnold93j}.

source: Per exemple, podria convenir que les frases angleses ``Sam gave a book to Leslie'' i ``Sam gave Leslie a book'' {arnold93j} tingueren la mateixa RALO.
es: Por ejemplo, podría convenir que las frases inglesas ``Sam gave a book to Leslie'' y ``Sam gave Leslie a book'' {arnold93j} tuvieran la misma RALO.
